clackups/draftling/firmware/sdkconfig.defaults.waveshare_touch_lcd_7
# CMakePresets.json board defaults: Waveshare ESP32-S3-Touch-LCD-7
# Sets the hardware model and IDF target used by the "waveshare_touch_lcd_7" preset.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_DRAFTLING_MODEL_WAVESHARE_TOUCH_LCD_7=y

# "SD card via USB" (F1 menu): expose the on-board MicroSD as a USB
# Mass Storage device over the ESP32-S3's native USB port. See
# components/usb_msc. This board's schematic labels its EXIO5 CH422G
# pin a "USB/CAN transceiver select" (see boards/waveshare_touch_lcd_7.h);
# Draftling does not drive it (no CAN/RS-485 support), so this relies
# on the pin's hardware-default pull selecting USB. Unconfirmed on
# physical hardware whether that default routes to the ESP32-S3's
# native USB-OTG controller.
CONFIG_TINYUSB_MSC_ENABLED=y
